archive/java/scratch/Thilina/MTOM/src/test-resources/OMSerializeBase64Out.txt

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Body><m:data xmlns:m="http://www.example.org/stuff"><m:value>rO0ABXNyAA9qYXZhLmxhbmcuRmxvYXTa7cmi2zzw7AIAAUYABXZhbHVleHIAEGphdmEubGFuZy5OdW1iZXKGrJUdC5TgiwIAAHhwP7pRGg==</m:value><m:sig m:contentType="application/pkcs7-signature">rO0ABXQAE1Byb2dyYW1taW5nIFByb2plY3Q=</m:sig><m:photo m:contentType="image/png">rO0ABXVyAAJbQqzzF/gGCFTgAgAAeHAAAAAGaWKKapGG</m:photo></m:data></soap:Body></soap:Envelope>